/// @file 
/// @brief Файл содержит реализацию классов для формирования исключений.

#include <database/include/precompiled.h>

namespace sqlite
{
//=====================================================================================================================
Exception:: Exception(const std::string& message ) : std::runtime_error(message)
{
}
//=====================================================================================================================
Exception::~Exception()
{
}
//=====================================================================================================================
} 
