/// @file 
/// @brief Файл содержит реализацию функторов для работы со строками

#include <database/include/precompiled.h>

namespace tools
{
//=====================================================================================================================	
std::wstring FirstString::operator()( void ) const throw()
{
	//Формируем результат
	const auto& result =  bFirst_ ? std::wstring() : data_;
	//Помечаем что не первое вхождение
	bFirst_ = false;
	//Возвращаем результат
	return result;
}
//=====================================================================================================================
FirstString::FirstString( const std::wstring& data ) : data_( data ), bFirst_( true )
{
}
//=====================================================================================================================
FirstString::~FirstString()
{
}
//=====================================================================================================================
}